window.createSvgPaths = function () {

    var aconveyorline = [
        "GBA01", "GBA0101", "GBA03", "GBA04", "GBA05", "GBA06", "GBA08", "GBA0801", "GBA10", "GBA11",
        "GBA12", "GBA07", "GBA13", "GBA14", "GBA15", "GBA16", "GBA17", "GBA18", "GBA19", "GBB01",
        "GBB0101", "GBB03", "GBB04", "GBB05", "GBB06", "GBB08", "GBB0801", "GBB10", "GBB11", "GBB12",
        "GBB07", "GBB13", "GBB14", "GBB15", "GBB16", "GBB17", "GBD01", "GBD0101", "GBD03", "GBD04",
        "GBD05", "GBD06", "GBD08", "GBD0801", "GBD10", "GBD11", "GBD12", "GBD07", "GBD13", "GBD14",
        "GBD15", "GBD16", "GBD17", "GBD18", "GBD19", "GBC01", "GBC0101", "GBC03", "GBC04", "GBC05",
        "GBC06", "GBC08", "GBC0801", "GBC10", "GBC11", "GBC12", "GBC07", "GBC13", "GBC14", "GBC15",
        "GBC16", "GBC17", "GBE01", "GBE0101", "GBE03", "GBE04", "GBE05", "GBE06", "GBE08", "GBE0801",
        "GBE10", "GBE11", "GBE12", "GBE07", "GBE13", "GBE14", "GBE15", "GBE16", "GBE17", "GBE18",
        "GBE19", "GBE20", "GBE21", "GBE22"
    ];

    var bconveyorline = [
        "GB0601A", "GB0602A", "GB0603A", "GB0604A", "GB0605A", "GB0606A", "GB0607A", "GB0608A", "GB0609A", "GB0610A",
        "GB0611A", "GB0612A", "GB0613A", "GB0614A",
        "GB0601B", "GB0602B", "GB0603B", "GB0604B", "GB0605B", "GB0606B", "GB0607B", "GB0608B", "GB0609B", "GB0610B",
        "GB0611B", "GB0612B", "GB0613B", "GB0614B",
        "GB0601D", "GB0602D", "GB0603D", "GB0604D", "GB0605D", "GB0606D", "GB0607D", "GB0608D", "GB0609D", "GB0610D",
        "GB0611D", "GB0612D", "GB0613D", "GB0614D",
        "GB0601C", "GB0602C", "GB0603C", "GB0604C", "GB0605C", "GB0606C", "GB0607C", "GB0608C", "GB0609C", "GB0610C",
        "GB0611C", "GB0612C", "GB0613C", "GB0614C",
        "GB0601E", "GB0602E", "GB0603E", "GB0604E", "GB0605E", "GB0606E", "GB0607E", "GB0608E", "GB0609E", "GB0610E",
        "GB0611E", "GB0612E", "GB0613E", "GB0614E"
    ];

    var ngline = ["NG01", "NG02", "NG03", "NG04", "NG05", "NG08", "NG09", "NG10", "GB0701", "GB0702",
        "GB0703", "GB0704", "GB0705"
    ];

    var nggbtline = ["GB0706", "GB0707", "GB0708", "GB0709"];

    var motor = [
        "1號电机", "2號电机", "3號电机", "4號电机", "5號电机", "6號电机", "7號电机", "8號电机", "9號电机", "10號电机", "11號电机", "12號电机", "13號电机",
        "14號电机", "15號电机", "16號电机", "17號电机", "18號电机", "19號电机", "20號电机", "21號电机", "22號电机", "23號电机", "24號电机", "25號电机",
        "26號电机", "27號电机", "28號电机", "29號电机", "30號电机", "31號电机", "32號电机", "33號电机", "34號电机", "35號电机", "36號电机", "37號电机", "38號电机"
    ];

    //防撞电机
    var collisionmotor = [
        "1號防撞", "2號防撞", "3號防撞", "4號防撞", "5號防撞", "6號防撞", "7號防撞", "8號防撞", "9號防撞", "10號防撞", "11號防撞", "12號防撞", "13號防撞",
        "14號防撞", "15號防撞", "16號防撞", "17號防撞", "18號防撞", "19號防撞", "20號防撞", "21號防撞", "22號防撞", "23號防撞", "24號防撞", "25號防撞",
        "26號防撞", "27號防撞", "28號防撞", "29號防撞", "30號防撞", "31號防撞", "32號防撞", "33號防撞", "34號防撞", "35號防撞", "36號防撞", "37號防撞", "38號防撞"
    ];

    //摆轮
    var blun = ["GBA02擺輪", "GBA09擺輪", "GBB02擺輪", "GBB09擺輪", "GBD02擺輪", "GBD09擺輪", "GBC02擺輪", "GBC09擺輪", "GBE02擺輪", "GBE09擺輪"];

    //合流支线
    var zhix = ["GBA07-01", "GBB07-01", "GBD07-01", "GBC07-01", "GBE07-01"];

    //急停
    var emg = [
        "1號全自動供包台急停", "2號全自動供包台急停", "3號全自動供包台急停", "4號全自動供包台急停", "5號全自動供包台急停", "NG供包台急停", "主控櫃急停", "GBA14急停",
        "GBA16急停", "GBB15急停", "GBD14急停", "GBD16急停", "GBC14急停", "GBE14急停", "GBE16急停", "GBE18急停", "GBE20急停",
    ];

    var scan = ["一區主環相機", "二區主環相機", "1號供包台相機", "2號供包台相機", "3號供包台相機", "4號供包台相機", "5號供包台相機", "糾偏灰度儀1", "糾偏灰度儀2"];

    var safetydoor = ["1號安全門", "2號安全門", "3號安全門", "4號安全門", "5號安全門"];

    const pathsafetydoor = [
        "M440 300 L480 300",
        "M1740 230 L1780 230",
        "M1300 730 L1340 730",
        "M80 680 L120 680",
        "M40 470 L80 470"
    ];

    const pathData = [
        "M140 220 L140 260",  //GBA
        "M140 262 L140 302",
        "M140 346 L140 388",
        "M140 390 L140 430",
        "M140 432 L140 482",
        "M140 484 L140 524",
        "M170 220 L170 260",
        "M170 262 L170 302",
        "M170 346 L170 388",
        "M170 390 L170 430",
        "M170 432 L170 482",
        "M170 484 L170 554",
        "M170 556 L170 616",
        "M170 618 A20 20 0 0 0 188 638",
        "M190 638 L340 638",
        "M342 638 A20 20 0 0 0 362 618",
        "M362 616 L362 580",
        "M362 578 L362 540",
        "M362 538 L362 500",

        "M200 220 L200 260",  //GBB
        "M200 262 L200 302",
        "M200 346 L200 388",
        "M200 390 L200 430",
        "M200 432 L200 482",
        "M200 484 L200 524",
        "M230 220 L230 260",
        "M230 262 L230 302",
        "M230 346 L230 388",
        "M230 390 L230 430",
        "M230 432 L230 482",
        "M230 484 L230 554",
        "M230 556 L230 600",
        "M230 602 A28 20 0 0 0 260 622",
        "M262 622 A28 20 0 0 0 292 602",
        "M292 600 L292 562",
        "M292 560 L292 522",

        "M1600 740 L1600 700",  //GBD
        "M1600 698 L1600 658",
        "M1600 614 L1600 574",
        "M1600 572 L1600 532",
        "M1600 530 L1600 490",
        "M1600 488 L1600 448",
        "M1570 740 L1570 700",
        "M1570 698 L1570 658",
        "M1570 614 L1570 574",
        "M1570 572 L1570 532",
        "M1570 530 L1570 470",
        "M1570 468 L1570 408",
        "M1570 406 L1570 358",
        "M1570 356 A28 20 0 0 0 1550 336",
        "M1548 336 L1430 336",
        "M1428 336 A28 20 0 0 0 1408 356",
        "M1408 358 L1408 398",
        "M1408 400 L1408 430",
        "M1408 432 L1408 472",

        "M1540 740 L1540 700",  //GBC
        "M1540 698 L1540 658",
        "M1540 614 L1540 574",
        "M1540 572 L1540 532",
        "M1540 530 L1540 490",
        "M1540 488 L1540 448",
        "M1510 740 L1510 700",
        "M1510 698 L1510 658",
        "M1510 614 L1510 574",
        "M1510 572 L1510 532",
        "M1510 530 L1510 470",
        "M1510 468 L1510 420",
        "M1510 418 L1510 388",
        "M1510 386 A28 20 0 0 0 1480 366",
        "M1478 366 A28 20 0 0 0 1448 386",
        "M1448 388 L1448 430",
        "M1448 432 L1448 472",

        "M1700 740 L1700 700",  //GBE
        "M1700 698 L1700 658",
        "M1700 614 L1700 574",
        "M1700 572 L1700 532",
        "M1700 530 L1700 490",
        "M1700 488 L1700 448",
        "M1670 740 L1670 700",
        "M1670 698 L1670 658",
        "M1670 614 L1670 574",
        "M1670 572 L1670 532",
        "M1670 530 L1670 470",
        "M1670 468 L1670 420",
        "M1670 418 L1670 388",
        "M1670 386 A20 20 0 0 1 1690 366",
        "M1692 366 L1728 366",
        "M1730 366 A20 20 0 0 1 1750 386",
        "M1750 388 L1750 628",
        "M1750 630 A20 20 0 0 1 1730 650",
        "M1728 650 L1650 650",
        "M1648 650 A20 20 0 0 1 1628 630",
        "M1628 628 L1628 598",
        "M1628 596 L1628 566",
    ];

    const pathData1 = [
        // 供包台					     
        "M362 498 L362 472", //GBA
        "M362 470 L362 434",
        "M362 432 L362 416",
        "M362 414 L362 398",
        "M362 396 L362 370",
        "M362 368 L356 352",
        "M356 350 L350 334",
        "M350 332 L344 316",
        "M344 314 L338 298",
        "M338 296 L332 280",
        "M332 278 L326 262",
        "M326 260 L320 244",
        "M320 242 L314 226",
        "M314 224 L308 210",

        "M292 520 L292 482", //GBB
        "M292 480 L292 450",
        "M292 448 L292 422",
        "M292 420 L292 398",
        "M292 396 L292 370",
        "M292 368 L288 352",
        "M288 350 L282 334",
        "M282 332 L276 316",
        "M276 314 L270 298",
        "M270 296 L264 280",
        "M264 278 L258 262",
        "M258 260 L252 244",
        "M252 242 L246 226",
        "M246 224 L240 210",

        "M1408 474 L1408 494",  //GBD
        "M1408 496 L1408 516",
        "M1408 518 L1408 538",
        "M1408 540 L1408 560",
        "M1408 562 L1408 582",
        "M1408 584 L1412 600",
        "M1412 602 L1416 618",
        "M1416 620 L1420 636",
        "M1420 638 L1426 654",
        "M1426 656 L1432 672",
        "M1432 674 L1438 690",
        "M1438 692 L1444 708",
        "M1444 710 L1450 726",
        "M1450 728 L1456 744",

        "M1448 474 L1448 494",  //GBC
        "M1448 496 L1448 516",
        "M1448 518 L1448 538",
        "M1448 540 L1448 560",
        "M1448 562 L1448 582",
        "M1448 584 L1452 600",
        "M1452 602 L1456 618",
        "M1456 620 L1460 636",
        "M1460 638 L1466 654",
        "M1466 656 L1472 672",
        "M1472 674 L1478 690",
        "M1478 692 L1484 708",
        "M1484 710 L1490 726",
        "M1490 728 L1496 744",

        "M1628 564 L1628 538",  //GBE
        "M1628 536 L1628 510",
        "M1628 508 L1628 486",
        "M1628 484 L1628 458",
        "M1628 456 L1628 430",
        "M1628 428 L1624 412",
        "M1624 410 L1620 394",
        "M1620 392 L1616 376",
        "M1616 374 L1612 358",
        "M1612 356 L1608 340",
        "M1608 338 L1604 322",
        "M1604 320 L1600 304",
        "M1600 302 L1596 286",
        "M1596 284 L1592 268",
    ];

    //NG输送线
    const pathNG = [
        "M598 290 L598 140",
        "M598 138 A20 20 0 0 0 578 118",
        "M576 118 L556 118",
        "M554 118 L534 118",
        "M532 118 L512 118",
        "M510 118 L490 118",
        "M488 118 L468 118",
        "M466 118 L446 118",
        "M444 118 L414 118",
        "M412 118 L382 118",
        "M380 118 L350 118",
        "M348 118 L318 118",
        "M316 118 L292 118",
    ];

    const pathNgGbt = [
        "M290 118 L270 134",
        "M268 134 L248 150",
        "M246 150 L226 166",
        "M224 166 L204 182"
    ];

    //电机
    const pathMoter = [
        "M150 690 L180 690",
        "M310 690 L340 690",
        "M530 580 L500 580",
        "M600 580 L570 580",
        "M670 580 L640 580",
        "M740 580 L710 580",
        "M810 580 L780 580",
        "M880 580 L850 580",
        "M950 580 L920 580",
        "M1020 580 L990 580",
        "M1090 580 L1060 580",
        "M1160 580 L1130 580",
        "M1230 580 L1200 580",
        "M1300 580 L1270 580",
        "M1470 790 L1500 790",
        "M1570 790 L1600 790",
        "M1670 790 L1700 790",
        "M1840 620 L1840 650",
        "M1840 420 L1840 450",
        "M1700 230 L1730 230",
        "M1600 230 L1630 230",
        "M1500 230 L1530 230",
        "M1300 420 L1270 420",
        "M1230 420 L1200 420",
        "M1160 420 L1130 420",
        "M1090 420 L1060 420",
        "M1020 420 L990 420",
        "M950 420 L920 420",
        "M880 420 L850 420",
        "M810 420 L780 420",
        "M740 420 L710 420",
        "M670 420 L640 420",
        "M600 420 L570 420",
        "M530 420 L500 420",
        "M270 170 L300 170",
        "M150 170 L180 170",
        "M68 300 L68 330",
        "M68 570 L68 600"
    ];

    const pathCollisionmotor = [
        "M150 710 L180 710",
        "M310 710 L340 710",
        "M530 560 L500 560",
        "M600 560 L570 560",
        "M670 560 L640 560",
        "M740 560 L710 560",
        "M810 560 L780 560",
        "M880 560 L850 560",
        "M950 560 L920 560",
        "M1020 560 L990 560",
        "M1090 560 L1060 560",
        "M1160 560 L1130 560",
        "M1230 560 L1200 560",
        "M1300 560 L1270 560",
        "M1470 810 L1500 810",
        "M1570 810 L1600 810",
        "M1670 810 L1700 810",
        "M1860 600 L1860 630",
        "M1860 400 L1860 430",
        "M1700 210 L1730 210",
        "M1600 210 L1630 210",
        "M1500 210 L1530 210",
        "M1300 440 L1270 440",
        "M1230 440 L1200 440",
        "M1160 440 L1130 440",
        "M1090 440 L1060 440",
        "M1020 440 L990 440",
        "M950 440 L920 440",
        "M880 440 L850 440",
        "M810 440 L780 440",
        "M740 440 L710 440",
        "M670 440 L640 440",
        "M600 440 L570 440",
        "M530 440 L500 440",
        "M270 150 L300 150",
        "M150 150 L180 150",
        "M50 320 L50 350",
        "M50 590 L50 620"
    ];

    const pathBlun = [
        "M140 304 L140 344",
        "M170 304 L170 344",
        "M200 304 L200 344",
        "M230 304 L230 344",
        "M1600 656 L1600 616",
        "M1570 656 L1570 616",
        "M1540 656 L1540 616",
        "M1510 656 L1510 616",
        "M1700 656 L1700 616",
        "M1670 656 L1670 616",
    ];

    const pathZhix = [
        "M140 526 A20 20 0 0 0 160 546", //GBA0701
        "M200 526 A20 20 0 0 0 220 546",
        "M1600 446 A20 20 0 0 0 1580 426",
        "M1540 446 A20 20 0 0 0 1520 426",
        "M1700 446 A20 20 0 0 0 1680 426",
    ];

    const pathEmg = [
        "M370 490 A5 5 0 1 1 366 489 Z",
        "M316 490 A5 5 0 1 1 312 489 Z",
        "M1400 490 A5 5 0 1 1 1396 489 Z",
        "M1332 490 A5 5 0 1 1 1328 489 Z",
        "M1586 740 A5 5 0 1 1 1582 739 Z",
        "M390 816 A5 5 0 1 1 386 815 Z",
        "M770 200 A5 5 0 1 1 766 199 Z",
        "M170 220 A5 5 0 1 1 166 219 Z",
        "M320 246 A5 5 0 1 1 316 245 Z",
        "M270 274 A5 5 0 1 1 266 273 Z",
        "M1530 790 A5 5 0 1 1 1526 789 Z",
        "M1350 790 A5 5 0 1 1 1350 789 Z", //GBD16急停
        "M1450 730 A5 5 0 1 1 1446 729 Z",
        "M1656 790 A5 5 0 1 1 1652 789 Z",
        "M1720 790 A5 5 0 1 1 1716 789 Z",
        "M1720 478 A5 5 0 1 1 1716 477 Z",
        "M1610 478 A5 5 0 1 1 1606 477 Z",
    ];

    //相机
    const pathScan = [
        "M380 690 L428 690",
        "M1504 280 L1552 280",
        "M382 440 L432 440",
        "M298 420 L348 420",
        "M1348 560 L1398 560",
        "M1460 580 L1504 580",
        "M1630 358 L1674 358",
        "M220 690 L268 690",
        "M1630 280 L1674 280",
    ];

    const svg = document.getElementById('svg');

    if (!svg) {
        return false;
    }

    function createPathWithLabel(svg, pathData, labels, className, textClassName, rotateText = false) {
        if (!pathData || !labels || pathData.length !== labels.length) {
            return;
        }

        pathData.forEach((path, index) => {
            try {
                const pathElement = document.createElementNS('http://www.w3.org/2000/svg', 'path');
                pathElement.setAttribute('d', path);
                pathElement.setAttribute('class', className);
                pathElement.setAttribute('name', labels[index] || `Path${index}`);
                pathElement.setAttribute('stroke', 'black');
                pathElement.setAttribute('fill', 'none');
                svg.appendChild(pathElement);

                const textElement = document.createElementNS('http://www.w3.org/2000/svg', 'text');
                textElement.setAttribute('class', textClassName);
                textElement.setAttribute('font-size', '8');
                textElement.textContent = labels[index] || '';

                const pathLength = pathElement.getTotalLength();
                const midPoint = pathElement.getPointAtLength(pathLength / 2);
                textElement.setAttribute('x', midPoint.x + 2);
                textElement.setAttribute('y', midPoint.y + 2);

                if (rotateText) {
                    textElement.setAttribute('transform', `rotate(-90 ${midPoint.x + 2} ${midPoint.y + 2})`);
                }

                svg.appendChild(textElement);
            } catch (error) {
                console.error('Error creating path element:', index, error);
            }
        });
    }

    // 路径描绘
    try {
        createPathWithLabel(svg, pathData, aconveyorline, 'line', 'aconveyorline-label', true);
        createPathWithLabel(svg, pathData1, bconveyorline, 'gbt', 'aconveyorline-label');
        createPathWithLabel(svg, pathNG, ngline, 'ng', 'aconveyorline-label');
        createPathWithLabel(svg, pathNgGbt, nggbtline, 'nggbt', 'aconveyorline-label');
        createPathWithLabel(svg, pathMoter, motor, 'motor', 'aconveyorline-label');
        createPathWithLabel(svg, pathCollisionmotor, collisionmotor, 'collisionmotor', 'aconveyorline-label');
        createPathWithLabel(svg, pathBlun, blun, 'blun', 'aconveyorline-label', true);
        createPathWithLabel(svg, pathZhix, zhix, 'zhix', 'collisionmotor-label', true);
        createPathWithLabel(svg, pathScan, scan, 'scan', 'collisionmotor-label');
        createPathWithLabel(svg, pathsafetydoor, safetydoor, 'safetydoor', 'collisionmotor-label');

        return true;
    } catch (error) {
        return false;
    }
}